OpenFOAM/simpleFsi/simpleFsi-OF4.1/cases/test-laminar-halfcyl-3DoF/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    cylinder
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    
    channel
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
